globalsdp/Tests/claro/v1/partner/wap_notification.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.3" jmeter="2.8.20130705">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Global SDP - WAP MT Notification" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1442878578000</longProp>
        <longProp name="ThreadGroup.end_time">1442878578000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Variable" enabled="true">
          <stringProp name="variableName">TRANSACTION_ID</stringProp>
          <stringProp name="outputFormat">000000000</stringProp>
          <stringProp name="minimumValue">000000000</stringProp>
          <stringProp name="maximumValue">999999999</stringProp>
          <boolProp name="perThread">false</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">content-type</stringProp>
              <stringProp name="Header.value">application/xml</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&lt;mse-response&gt;&#xd;
   &lt;status-code&gt;0&lt;/status-code&gt;&#xd;
   &lt;profile&gt;profileId&lt;/profile&gt;&#xd;
   &lt;transaction-id&gt;${TRANSACTION_ID}&lt;/transaction-id&gt;&#xd;
   &lt;parameters&gt;&#xd;
      &lt;param-item&gt;&#xd;
         &lt;param-name&gt;SMPP_MESSAGE_STATUS&lt;/param-name&gt;&#xd;
         &lt;param-value&gt;DELIVRD&lt;/param-value&gt;&#xd;
      &lt;/param-item&gt;&#xd;
      &lt;param-item&gt;&#xd;
         &lt;param-name&gt;MSGSTATUS&lt;/param-name&gt;&#xd;
         &lt;param-value&gt;2&lt;/param-value&gt;&#xd;
      &lt;/param-item&gt;&#xd;
      &lt;param-item&gt;&#xd;
         &lt;param-name&gt;FINALDATE&lt;/param-name&gt;&#xd;
         &lt;param-value&gt;0608241423&lt;/param-value&gt;&#xd;
      &lt;/param-item&gt;&#xd;
      &lt;param-item&gt;&#xd;
         &lt;param-name&gt;ANUM&lt;/param-name&gt;&#xd;
         &lt;param-value&gt;1176000000&lt;/param-value&gt;&#xd;
      &lt;/param-item&gt;&#xd;
      &lt;param-item&gt;&#xd;
         &lt;param-name&gt;INITIALDATE&lt;/param-name&gt;&#xd;
         &lt;param-value&gt;0608241423&lt;/param-value&gt;&#xd;
      &lt;/param-item&gt;&#xd;
      &lt;param-item&gt;&#xd;
         &lt;param-name&gt;BNUM&lt;/param-name&gt;&#xd;
         &lt;param-value&gt;4001&lt;/param-value&gt;&#xd;
      &lt;/param-item&gt;&#xd;
   &lt;/parameters&gt;&#xd;
&lt;/mse-response&gt;</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">10.170.128.55</stringProp>
          <stringProp name="HTTPSampler.port">8888</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">claro/v1/notification/wap?pwd=d9b475e7dd35436e91e6ae65f7432c2f&amp;userId=567f6ee58c744dc0a39dc8987c9417cd</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>